RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc13x0/inc/hw_ccfg.h
// Field:    [23] WRT_PROT_SEC_87
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_87                        0x00800000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_87_BITN                           23
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_87_M                      0x00800000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_87_S                              23

// Field:    [22] WRT_PROT_SEC_86
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_86                        0x00400000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_86_BITN                           22
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_86_M                      0x00400000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_86_S                              22

// Field:    [21] WRT_PROT_SEC_85
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_85                        0x00200000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_85_BITN                           21
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_85_M                      0x00200000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_85_S                              21

// Field:    [20] WRT_PROT_SEC_84
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_84                        0x00100000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_84_BITN                           20
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_84_M                      0x00100000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_84_S                              20

// Field:    [19] WRT_PROT_SEC_83
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_83                        0x00080000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_83_BITN                           19
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_83_M                      0x00080000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_83_S                              19

// Field:    [18] WRT_PROT_SEC_82
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_82                        0x00040000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_82_BITN                           18
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_82_M                      0x00040000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_82_S                              18

// Field:    [17] WRT_PROT_SEC_81
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_81                        0x00020000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_81_BITN                           17
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_81_M                      0x00020000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_81_S                              17

// Field:    [16] WRT_PROT_SEC_80
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80                        0x00010000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80_BITN                           16
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80_M                      0x00010000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80_S                              16

// Field:    [15] WRT_PROT_SEC_79
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_79                        0x00008000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_79_BITN                           15
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_79_M                      0x00008000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_79_S                              15

// Field:    [14] WRT_PROT_SEC_78
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_78                        0x00004000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_78_BITN                           14
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_78_M                      0x00004000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_78_S                              14

// Field:    [13] WRT_PROT_SEC_77
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_77                        0x00002000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_77_BITN                           13
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_77_M                      0x00002000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_77_S                              13

// Field:    [12] WRT_PROT_SEC_76
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_76                        0x00001000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_76_BITN                           12
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_76_M                      0x00001000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_76_S                              12

// Field:    [11] WRT_PROT_SEC_75
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_75                        0x00000800
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_75_BITN                           11
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_75_M                      0x00000800
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_75_S                              11

// Field:    [10] WRT_PROT_SEC_74
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_74                        0x00000400
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_74_BITN                           10
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_74_M                      0x00000400
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_74_S                              10

// Field:     [9] WRT_PROT_SEC_73
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_73                        0x00000200
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_73_BITN                            9
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_73_M                      0x00000200
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_73_S                               9

// Field:     [8] WRT_PROT_SEC_72
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_72                        0x00000100
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_72_BITN                            8
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_72_M                      0x00000100
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_72_S                               8

// Field:     [7] WRT_PROT_SEC_71
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_71                        0x00000080
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_71_BITN                            7
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_71_M                      0x00000080
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_71_S                               7

// Field:     [6] WRT_PROT_SEC_70
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70                        0x00000040
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_BITN                            6
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_M                      0x00000040
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_S                               6

// Field:     [5] WRT_PROT_SEC_69
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69                        0x00000020
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_BITN                            5
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_M                      0x00000020
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_S                               5

// Field:     [4] WRT_PROT_SEC_68
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68                        0x00000010
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_BITN                            4
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_M                      0x00000010
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_S                               4

// Field:     [3] WRT_PROT_SEC_67
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67                        0x00000008
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_BITN                            3
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_M                      0x00000008
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_S                               3

